zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/cc32xx/inc/hw_hib1p2.h
#define HIB1P2_O_HIB_TIMER_SYNC_TSF_CURR_VAL_LSW \
                                0x00000108

#define HIB1P2_O_HIB_TIMER_SYNC_TSF_CURR_VAL_MSW \
                                0x0000010C

#define HIB1P2_O_CM_SPARE       0x00000110
#define HIB1P2_O_PORPOL_SPARE   0x00000114
#define HIB1P2_O_MEM_DIG_DCDC_CLK_CONFIG \
                                0x00000118

#define HIB1P2_O_MEM_ANA_DCDC_CLK_CONFIG \
                                0x0000011C

#define HIB1P2_O_MEM_FLASH_DCDC_CLK_CONFIG \
                                0x00000120

#define HIB1P2_O_MEM_PA_DCDC_CLK_CONFIG \
                                0x00000124

#define HIB1P2_O_MEM_SLDO_VNWA_OVERRIDE \
                                0x00000128

#define HIB1P2_O_MEM_BGAP_DUTY_CYCLING_ENABLE_OVERRIDE \
                                0x0000012C

#define HIB1P2_O_MEM_HIB_FSM_DEBUG \
                                0x00000130

#define HIB1P2_O_MEM_SLDO_VNWA_SW_CTRL \
                                0x00000134

#define HIB1P2_O_MEM_SLDO_WEAK_PROCESS \
                                0x00000138

#define HIB1P2_O_MEM_PA_DCDC_OV_UV_STATUS \
                                0x0000013C

#define HIB1P2_O_MEM_CM_TEST_MODE \
                                0x00000140




//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_SRAM_SKA_LDO_PARAMETERS0 register.
//
//******************************************************************************
#define HIB1P2_SRAM_SKA_LDO_PARAMETERS0_mem_sldo_en_sc_itrim_lowv_M \
                                0xC0000000

#define HIB1P2_SRAM_SKA_LDO_PARAMETERS0_mem_sldo_en_sc_itrim_lowv_S 30
#define HIB1P2_SRAM_SKA_LDO_PARAMETERS0_mem_sldo_en_iq_trim_lowv_M \
                                0x30000000

#define HIB1P2_SRAM_SKA_LDO_PARAMETERS0_mem_sldo_en_iq_trim_lowv_S 28
#define HIB1P2_SRAM_SKA_LDO_PARAMETERS0_mem_sldo_en_sc_prot_lowv \
                                0x08000000

#define HIB1P2_SRAM_SKA_LDO_PARAMETERS0_mem_sldo_en_lowv_override \
                                0x04000000  // FSM Override value for SLDO_EN :
                                            // Applicable only when bit [4] of
                                            // this register is set to 1.

#define HIB1P2_SRAM_SKA_LDO_PARAMETERS0_mem_sldo_en_low_pwr_lowv \
                                0x02000000

#define HIB1P2_SRAM_SKA_LDO_PARAMETERS0_mem_sldo_int_cap_sel_lowv \
                                0x01000000

#define HIB1P2_SRAM_SKA_LDO_PARAMETERS0_mem_sldo_vtrim_lowv_M \
                                0x00FC0000

#define HIB1P2_SRAM_SKA_LDO_PARAMETERS0_mem_sldo_vtrim_lowv_S 18
#define HIB1P2_SRAM_SKA_LDO_PARAMETERS0_mem_sldo_spare_lowv_M \
                                0x0003FF00

#define HIB1P2_SRAM_SKA_LDO_PARAMETERS0_mem_sldo_spare_lowv_S 8
#define HIB1P2_SRAM_SKA_LDO_PARAMETERS0_mem_skaldo_en_lowv_override \
                                0x00000080  // FSM Override value for
                                            // SKA_LDO_EN : Applicable only when
                                            // bit [3] of this register is set
                                            // to 1.

#define HIB1P2_SRAM_SKA_LDO_PARAMETERS0_mem_skaldo_en_cap_ref_lowv \
                                0x00000040

#define HIB1P2_SRAM_SKA_LDO_PARAMETERS0_mem_skaldo_en_resdiv_ref_lowv \
                                0x00000020

#define HIB1P2_SRAM_SKA_LDO_PARAMETERS0_mem_sldo_en_lowv_fsm_override_ctrl \
                                0x00000010  // When 1, bit[26] of this register
                                            // will be used as SLDO_EN

#define HIB1P2_SRAM_SKA_LDO_PARAMETERS0_mem_skaldo_en_lowv_fsm_override_ctrl \
                                0x00000008  // When 1, bit[26] of this register
                                            // will be used as SKA_LDO_EN

#define HIB1P2_SRAM_SKA_LDO_PARAMETERS0_NA1_M \
                                0x00000007

#define HIB1P2_SRAM_SKA_LDO_PARAMETERS0_NA1_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_SRAM_SKA_LDO_PARAMETERS1 register.
//
//******************************************************************************
#define HIB1P2_SRAM_SKA_LDO_PARAMETERS1_mem_skaldo_ctrl_lowv_M \
                                0xFFC00000

#define HIB1P2_SRAM_SKA_LDO_PARAMETERS1_mem_skaldo_ctrl_lowv_S 22
#define HIB1P2_SRAM_SKA_LDO_PARAMETERS1_mem_skaldo_vtrim_lowv_M \
                                0x003F0000

#define HIB1P2_SRAM_SKA_LDO_PARAMETERS1_mem_skaldo_vtrim_lowv_S 16
#define HIB1P2_SRAM_SKA_LDO_PARAMETERS1_mem_sldo_en_tload_lowv \
                                0x00008000

#define HIB1P2_SRAM_SKA_LDO_PARAMETERS1_mem_skaldo_en_tload_lowv \
                                0x00004000

#define HIB1P2_SRAM_SKA_LDO_PARAMETERS1_mem_skaldo_cap_sw_en_lowv \
                                0x00002000

#define HIB1P2_SRAM_SKA_LDO_PARAMETERS1_mem_skaldo_en_hib_lowv \
                                0x00001000

#define HIB1P2_SRAM_SKA_LDO_PARAMETERS1_mem_skaldo_en_vref_buf_lowv \
                                0x00000800

#define HIB1P2_SRAM_SKA_LDO_PARAMETERS1_NA2_M \
                                0x000007FF

#define HIB1P2_SRAM_SKA_LDO_PARAMETERS1_NA2_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_DIG_DCDC_PARAMETERS0 register.
//
//******************************************************************************
#define HIB1P2_DIG_DCDC_PARAMETERS0_mem_dcdc_dig_en_lowv_override \
                                0x80000000  // Override value for DCDC_DIG_EN :
                                            // Applicable only when bit [31] of
                                            // DIG_DCDC_PARAMETERS1 [0x000C] is
                                            // set to 1. Else from FSM

#define HIB1P2_DIG_DCDC_PARAMETERS0_mem_dcdc_dig_delayed_en_lowv \
                                0x40000000

#define HIB1P2_DIG_DCDC_PARAMETERS0_mem_dcdc_dig_en_subreg_1p8v_lowv_override \
                                0x20000000  // Override value for
                                            // DCDC_DIG_EN_SUBREG_1P8V :
                                            // Applicable only when bit [30] of
                                            // DIG_DCDC_PARAMETERS1 [0x000C] is
                                            // set to 1. Else from FSM

