zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/cc32xx/inc/hw_hib1p2.h
#define HIB1P2_FLASH_DCDC_PARAMETERS2_mem_dcdc_flash_ilim_trim_lowv_override_M \
                                0x000003FC

#define HIB1P2_FLASH_DCDC_PARAMETERS2_mem_dcdc_flash_ilim_trim_lowv_override_S 2
#define HIB1P2_FLASH_DCDC_PARAMETERS2_mem_dcdc_flash_ilim_mask_dly_sel_lowv_M \
                                0x00000003

#define HIB1P2_FLASH_DCDC_PARAMETERS2_mem_dcdc_flash_ilim_mask_dly_sel_lowv_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_FLASH_DCDC_PARAMETERS3 register.
//
//******************************************************************************
#define HIB1P2_FLASH_DCDC_PARAMETERS3_mem_dcdc_flash_en_anti_glitch_lowv \
                                0x80000000

#define HIB1P2_FLASH_DCDC_PARAMETERS3_mem_dcdc_flash_en_hi_clamp_lowv \
                                0x40000000

#define HIB1P2_FLASH_DCDC_PARAMETERS3_mem_dcdc_flash_en_lo_clamp_lowv \
                                0x20000000

#define HIB1P2_FLASH_DCDC_PARAMETERS3_mem_dcdc_flash_ramp_hgt_lowv_M \
                                0x1F000000

#define HIB1P2_FLASH_DCDC_PARAMETERS3_mem_dcdc_flash_ramp_hgt_lowv_S 24
#define HIB1P2_FLASH_DCDC_PARAMETERS3_mem_dcdc_flash_vclamph_trim_lowv_M \
                                0x00E00000

#define HIB1P2_FLASH_DCDC_PARAMETERS3_mem_dcdc_flash_vclamph_trim_lowv_S 21
#define HIB1P2_FLASH_DCDC_PARAMETERS3_mem_dcdc_flash_vclampl_trim_lowv_M \
                                0x001C0000

#define HIB1P2_FLASH_DCDC_PARAMETERS3_mem_dcdc_flash_vclampl_trim_lowv_S 18
#define HIB1P2_FLASH_DCDC_PARAMETERS3_mem_dcdc_flash_vtrim_lowv_M \
                                0x0003C000

#define HIB1P2_FLASH_DCDC_PARAMETERS3_mem_dcdc_flash_vtrim_lowv_S 14
#define HIB1P2_FLASH_DCDC_PARAMETERS3_mem_dcdc_flash_pfm_ripple_trim_lowv_M \
                                0x00003C00

#define HIB1P2_FLASH_DCDC_PARAMETERS3_mem_dcdc_flash_pfm_ripple_trim_lowv_S 10
#define HIB1P2_FLASH_DCDC_PARAMETERS3_mem_dcdc_flash_slp_drv_dly_sel_lowv_M \
                                0x00000300

#define HIB1P2_FLASH_DCDC_PARAMETERS3_mem_dcdc_flash_slp_drv_dly_sel_lowv_S 8
#define HIB1P2_FLASH_DCDC_PARAMETERS3_mem_dcdc_flash_en_ov_prot_lowv \
                                0x00000080

#define HIB1P2_FLASH_DCDC_PARAMETERS3_mem_dcdc_flash_en_uv_prot_lowv \
                                0x00000040

#define HIB1P2_FLASH_DCDC_PARAMETERS3_mem_dcdc_flash_en_tmux_lowv \
                                0x00000020

#define HIB1P2_FLASH_DCDC_PARAMETERS3_NA19_M \
                                0x0000001F

#define HIB1P2_FLASH_DCDC_PARAMETERS3_NA19_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_FLASH_DCDC_PARAMETERS4 register.
//
//******************************************************************************
#define HIB1P2_FLASH_DCDC_PARAMETERS4_mem_dcdc_flash_tmux_ctrl_lowv_M \
                                0xFFFFFFFF

#define HIB1P2_FLASH_DCDC_PARAMETERS4_mem_dcdc_flash_tmux_ctrl_lowv_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_FLASH_DCDC_PARAMETERS5 register.
//
//******************************************************************************
#define HIB1P2_FLASH_DCDC_PARAMETERS5_mem_dcdc_flash_spare_lowv_M \
                                0xFFFFFFFF

#define HIB1P2_FLASH_DCDC_PARAMETERS5_mem_dcdc_flash_spare_lowv_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_FLASH_DCDC_PARAMETERS6 register.
//
//******************************************************************************
#define HIB1P2_FLASH_DCDC_PARAMETERS6_dcdc_flash_ov_prot_out_lowv \
                                0x80000000

#define HIB1P2_FLASH_DCDC_PARAMETERS6_dcdc_flash_uv_prot_out_lowv \
                                0x40000000

#define HIB1P2_FLASH_DCDC_PARAMETERS6_NA20_M \
                                0x3FFFFFFF

#define HIB1P2_FLASH_DCDC_PARAMETERS6_NA20_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_PMBIST_PARAMETERS0 register.
//
//******************************************************************************
#define HIB1P2_PMBIST_PARAMETERS0_mem_pm_bist_en_lowv \
                                0x80000000

#define HIB1P2_PMBIST_PARAMETERS0_mem_pm_bist_ctrl_lowv_M \
                                0x7FFFF800

#define HIB1P2_PMBIST_PARAMETERS0_mem_pm_bist_ctrl_lowv_S 11
#define HIB1P2_PMBIST_PARAMETERS0_NA21_M \
                                0x000007FF

#define HIB1P2_PMBIST_PARAMETERS0_NA21_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_PMBIST_PARAMETERS1 register.
//
//******************************************************************************
#define HIB1P2_PMBIST_PARAMETERS1_mem_pm_bist_spare_lowv_M \
                                0xFFFF0000

#define HIB1P2_PMBIST_PARAMETERS1_mem_pm_bist_spare_lowv_S 16
#define HIB1P2_PMBIST_PARAMETERS1_mem_pmtest_en_lowv \
                                0x00008000

#define HIB1P2_PMBIST_PARAMETERS1_NA22_M \
                                0x00007FFF

#define HIB1P2_PMBIST_PARAMETERS1_NA22_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_PMBIST_PARAMETERS2 register.
//
//******************************************************************************
#define HIB1P2_PMBIST_PARAMETERS2_mem_pmtest_tmux_ctrl_lowv_M \
                                0xFFFFFFFF

#define HIB1P2_PMBIST_PARAMETERS2_mem_pmtest_tmux_ctrl_lowv_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_PMBIST_PARAMETERS3 register.
//
//******************************************************************************
#define HIB1P2_PMBIST_PARAMETERS3_mem_pmtest_spare_lowv_M \
                                0xFFFF0000

#define HIB1P2_PMBIST_PARAMETERS3_mem_pmtest_spare_lowv_S 16
#define HIB1P2_PMBIST_PARAMETERS3_mem_pmtest_load_trim_lowv_M \
                                0x0000E000

#define HIB1P2_PMBIST_PARAMETERS3_mem_pmtest_load_trim_lowv_S 13
#define HIB1P2_PMBIST_PARAMETERS3_mem_rnwell_calib_en_lowv \
                                0x00001000

#define HIB1P2_PMBIST_PARAMETERS3_NA23_M \
                                0x00000FFF

#define HIB1P2_PMBIST_PARAMETERS3_NA23_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_FLASH_DCDC_PARAMETERS8 register.
//
//******************************************************************************
#define HIB1P2_FLASH_DCDC_PARAMETERS8_mem_en_flash_sup_comp_lowv \
                                0x80000000

#define HIB1P2_FLASH_DCDC_PARAMETERS8_mem_flash_high_sup_trim_lowv_M \
                                0x7C000000

#define HIB1P2_FLASH_DCDC_PARAMETERS8_mem_flash_high_sup_trim_lowv_S 26
#define HIB1P2_FLASH_DCDC_PARAMETERS8_mem_flash_low_sup_trim_lowv_M \
                                0x03E00000

#define HIB1P2_FLASH_DCDC_PARAMETERS8_mem_flash_low_sup_trim_lowv_S 21
#define HIB1P2_FLASH_DCDC_PARAMETERS8_NA24_M \
                                0x001FFFFF

#define HIB1P2_FLASH_DCDC_PARAMETERS8_NA24_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_ANA_DCDC_PARAMETERS_OVERRIDE register.
//
//******************************************************************************
#define HIB1P2_ANA_DCDC_PARAMETERS_OVERRIDE_reserved_M \
                                0xFFFFFFC0

