zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/cc32xx/inc/hw_hib1p2.h
#define HIB1P2_ANA_DCDC_PARAMETERS_OVERRIDE_reserved_S 6
#define HIB1P2_ANA_DCDC_PARAMETERS_OVERRIDE_mem_dcdc_ana_en_subreg_1p2v_lowv_override_ctrl \
                                0x00000020

#define HIB1P2_ANA_DCDC_PARAMETERS_OVERRIDE_mem_dcdc_ana_en_subreg_1p8v_lowv_override_ctrl \
                                0x00000010

#define HIB1P2_ANA_DCDC_PARAMETERS_OVERRIDE_mem_dcdc_ana_ilim_trim_lowv_efc_override_ctrl \
                                0x00000008

#define HIB1P2_ANA_DCDC_PARAMETERS_OVERRIDE_mem_dcdc_ana_en_slp_mode_lowv_fsm_override_ctrl \
                                0x00000004

#define HIB1P2_ANA_DCDC_PARAMETERS_OVERRIDE_mem_dcdc_ana_en_pwm_mode_lowv_fsm_override_ctrl \
                                0x00000002

#define HIB1P2_ANA_DCDC_PARAMETERS_OVERRIDE_mem_dcdc_ana_en_lowv_fsm_override_ctrl \
                                0x00000001

//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_FLASH_DCDC_PARAMETERS_OVERRIDE register.
//
//******************************************************************************
#define HIB1P2_FLASH_DCDC_PARAMETERS_OVERRIDE_reserved_M \
                                0xFFFFFFFC

#define HIB1P2_FLASH_DCDC_PARAMETERS_OVERRIDE_reserved_S 2
#define HIB1P2_FLASH_DCDC_PARAMETERS_OVERRIDE_mem_dcdc_flash_en_lowv_override_ctrl \
                                0x00000002

#define HIB1P2_FLASH_DCDC_PARAMETERS_OVERRIDE_mem_dcdc_flash_ilim_trim_lowv_override_ctrl \
                                0x00000001

//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_DIG_DCDC_VTRIM_CFG register.
//
//******************************************************************************
#define HIB1P2_DIG_DCDC_VTRIM_CFG_reserved_M \
                                0xFF000000

#define HIB1P2_DIG_DCDC_VTRIM_CFG_reserved_S 24
#define HIB1P2_DIG_DCDC_VTRIM_CFG_mem_dcdc_dig_run_vtrim_M \
                                0x00FC0000

#define HIB1P2_DIG_DCDC_VTRIM_CFG_mem_dcdc_dig_run_vtrim_S 18
#define HIB1P2_DIG_DCDC_VTRIM_CFG_mem_dcdc_dig_dslp_vtrim_M \
                                0x0003F000

#define HIB1P2_DIG_DCDC_VTRIM_CFG_mem_dcdc_dig_dslp_vtrim_S 12
#define HIB1P2_DIG_DCDC_VTRIM_CFG_mem_dcdc_dig_lpds_vtrim_M \
                                0x00000FC0

#define HIB1P2_DIG_DCDC_VTRIM_CFG_mem_dcdc_dig_lpds_vtrim_S 6
#define HIB1P2_DIG_DCDC_VTRIM_CFG_Spare_RW_M \
                                0x0000003F

#define HIB1P2_DIG_DCDC_VTRIM_CFG_Spare_RW_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_DIG_DCDC_FSM_PARAMETERS register.
//
//******************************************************************************
#define HIB1P2_DIG_DCDC_FSM_PARAMETERS_reserved_M \
                                0xFFFF8000

#define HIB1P2_DIG_DCDC_FSM_PARAMETERS_reserved_S 15
#define HIB1P2_DIG_DCDC_FSM_PARAMETERS_mem_dcdc_dig_dslp_enter_cot_to_vtrim_M \
                                0x00007000

#define HIB1P2_DIG_DCDC_FSM_PARAMETERS_mem_dcdc_dig_dslp_enter_cot_to_vtrim_S 12
#define HIB1P2_DIG_DCDC_FSM_PARAMETERS_mem_dcdc_dig_dslp_enter_vtrim_to_sleep_M \
                                0x00000E00

#define HIB1P2_DIG_DCDC_FSM_PARAMETERS_mem_dcdc_dig_dslp_enter_vtrim_to_sleep_S 9
#define HIB1P2_DIG_DCDC_FSM_PARAMETERS_mem_dcdc_dig_dslp_exit_sleep_to_vtrim_M \
                                0x000001C0

#define HIB1P2_DIG_DCDC_FSM_PARAMETERS_mem_dcdc_dig_dslp_exit_sleep_to_vtrim_S 6
#define HIB1P2_DIG_DCDC_FSM_PARAMETERS_mem_dcdc_dig_dslp_exit_vtrim_to_cot_M \
                                0x00000038

#define HIB1P2_DIG_DCDC_FSM_PARAMETERS_mem_dcdc_dig_dslp_exit_vtrim_to_cot_S 3
#define HIB1P2_DIG_DCDC_FSM_PARAMETERS_mem_dcdc_dig_dslp_exit_cot_to_run_M \
                                0x00000007

#define HIB1P2_DIG_DCDC_FSM_PARAMETERS_mem_dcdc_dig_dslp_exit_cot_to_run_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_ANA_DCDC_FSM_PARAMETERS register.
//
//******************************************************************************
#define HIB1P2_ANA_DCDC_FSM_PARAMETERS_reserved_M \
                                0xFFFFFFF8

#define HIB1P2_ANA_DCDC_FSM_PARAMETERS_reserved_S 3
#define HIB1P2_ANA_DCDC_FSM_PARAMETERS_mem_dcdc_ana_dslp_exit_sleep_to_run_M \
                                0x00000007

#define HIB1P2_ANA_DCDC_FSM_PARAMETERS_mem_dcdc_ana_dslp_exit_sleep_to_run_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_SRAM_SKA_LDO_FSM_PARAMETERS register.
//
//******************************************************************************
#define HIB1P2_SRAM_SKA_LDO_FSM_PARAMETERS_reserved_M \
                                0xFFFFFFC0

#define HIB1P2_SRAM_SKA_LDO_FSM_PARAMETERS_reserved_S 6
#define HIB1P2_SRAM_SKA_LDO_FSM_PARAMETERS_mem_ska_ldo_en_to_sram_ldo_dis_M \
                                0x00000038

#define HIB1P2_SRAM_SKA_LDO_FSM_PARAMETERS_mem_ska_ldo_en_to_sram_ldo_dis_S 3
#define HIB1P2_SRAM_SKA_LDO_FSM_PARAMETERS_mem_sram_ldo_en_to_ska_ldo_dis_M \
                                0x00000007

#define HIB1P2_SRAM_SKA_LDO_FSM_PARAMETERS_mem_sram_ldo_en_to_ska_ldo_dis_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_BGAP_DUTY_CYCLING_EXIT_CFG register.
//
//******************************************************************************
#define HIB1P2_BGAP_DUTY_CYCLING_EXIT_CFG_reserved_M \
                                0xFFFFFFF8

#define HIB1P2_BGAP_DUTY_CYCLING_EXIT_CFG_reserved_S 3
#define HIB1P2_BGAP_DUTY_CYCLING_EXIT_CFG_mem_bgap_duty_cycling_exit_time_M \
                                0x00000007

#define HIB1P2_BGAP_DUTY_CYCLING_EXIT_CFG_mem_bgap_duty_cycling_exit_time_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_CM_OSC_16M_CONFIG register.
//
//******************************************************************************
#define HIB1P2_CM_OSC_16M_CONFIG_reserved_M \
                                0xFFFC0000

