zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/cc32xx/inc/hw_hib1p2.h
#define HIB1P2_CM_OSC_16M_CONFIG_reserved_S 18
#define HIB1P2_CM_OSC_16M_CONFIG_cm_clk_good_16m \
                                0x00020000

#define HIB1P2_CM_OSC_16M_CONFIG_mem_cm_en_osc_16m \
                                0x00010000

#define HIB1P2_CM_OSC_16M_CONFIG_mem_cm_osc_16m_trim_M \
                                0x0000FC00

#define HIB1P2_CM_OSC_16M_CONFIG_mem_cm_osc_16m_trim_S 10
#define HIB1P2_CM_OSC_16M_CONFIG_mem_cm_osc_16m_spare_M \
                                0x000003F0

#define HIB1P2_CM_OSC_16M_CONFIG_mem_cm_osc_16m_spare_S 4
#define HIB1P2_CM_OSC_16M_CONFIG_mem_cm_osc_en_sli_16m \
                                0x00000008

#define HIB1P2_CM_OSC_16M_CONFIG_mem_cm_sli_16m_trim_M \
                                0x00000007

#define HIB1P2_CM_OSC_16M_CONFIG_mem_cm_sli_16m_trim_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_SOP_SENSE_VALUE register.
//
//******************************************************************************
#define HIB1P2_SOP_SENSE_VALUE_reserved_M \
                                0xFFFFFF00

#define HIB1P2_SOP_SENSE_VALUE_reserved_S 8
#define HIB1P2_SOP_SENSE_VALUE_sop_sense_value_M \
                                0x000000FF

#define HIB1P2_SOP_SENSE_VALUE_sop_sense_value_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_HIB_RTC_TIMER_LSW_1P2 register.
//
//******************************************************************************
#define HIB1P2_HIB_RTC_TIMER_LSW_1P2_hib_rtc_timer_lsw_M \
                                0xFFFFFFFF

#define HIB1P2_HIB_RTC_TIMER_LSW_1P2_hib_rtc_timer_lsw_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_HIB_RTC_TIMER_MSW_1P2 register.
//
//******************************************************************************
#define HIB1P2_HIB_RTC_TIMER_MSW_1P2_hib_rtc_timer_msw_M \
                                0x0000FFFF

#define HIB1P2_HIB_RTC_TIMER_MSW_1P2_hib_rtc_timer_msw_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_HIB1P2_BGAP_TRIM_OVERRIDES register.
//
//******************************************************************************
#define HIB1P2_HIB1P2_BGAP_TRIM_OVERRIDES_reserved_M \
                                0xFF800000

#define HIB1P2_HIB1P2_BGAP_TRIM_OVERRIDES_reserved_S 23
#define HIB1P2_HIB1P2_BGAP_TRIM_OVERRIDES_mem_bgap_mag_trim_override_ctrl \
                                0x00400000

#define HIB1P2_HIB1P2_BGAP_TRIM_OVERRIDES_mem_bgap_mag_trim_override_M \
                                0x003FC000

#define HIB1P2_HIB1P2_BGAP_TRIM_OVERRIDES_mem_bgap_mag_trim_override_S 14
#define HIB1P2_HIB1P2_BGAP_TRIM_OVERRIDES_mem_bgap_temp_trim_override_ctrl \
                                0x00002000

#define HIB1P2_HIB1P2_BGAP_TRIM_OVERRIDES_mem_bgap_temp_trim_override_M \
                                0x00001FC0

#define HIB1P2_HIB1P2_BGAP_TRIM_OVERRIDES_mem_bgap_temp_trim_override_S 6
#define HIB1P2_HIB1P2_BGAP_TRIM_OVERRIDES_mem_bgap_rtrim_override_ctrl \
                                0x00000020

#define HIB1P2_HIB1P2_BGAP_TRIM_OVERRIDES_mem_bgap_rtrim_override_M \
                                0x0000001F

#define HIB1P2_HIB1P2_BGAP_TRIM_OVERRIDES_mem_bgap_rtrim_override_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_HIB1P2_EFUSE_READ_REG0 register.
//
//******************************************************************************
#define HIB1P2_HIB1P2_EFUSE_READ_REG0_FUSEFARM_ROW_12_M \
                                0xFFFFFFFF  // Corresponds to ROW_12 of
                                            // FUSEFARM. [7:0] :
                                            // DCDC_DIG_ILIM_TRIM_LOWV(7:0)
                                            // [15:8] :
                                            // DCDC_ANA_ILIM_TRIM_LOWV(7:0)
                                            // [23:16] :
                                            // DCDC_FLASH_ILIM_TRIM_LOWV(7:0)
                                            // [24:24] : DTHE SHA DISABLE
                                            // [25:25] : DTHE DES DISABLE
                                            // [26:26] : DTHE AES DISABLE
                                            // [31:27] : HD_BG_RTRIM (4:0)

#define HIB1P2_HIB1P2_EFUSE_READ_REG0_FUSEFARM_ROW_12_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_HIB1P2_EFUSE_READ_REG1 register.
//
//******************************************************************************
#define HIB1P2_HIB1P2_EFUSE_READ_REG1_FUSEFARM_ROW_13_M \
                                0xFFFFFFFF  // Corresponds to ROW_13 of the
                                            // FUSEFARM. [7:0] : HD_BG_MAG_TRIM
                                            // (7:0) [14:8] : HD_BG_TEMP_TRIM
                                            // (6:0) [15:15] : GREYOUT ENABLE
                                            // DUTY CYCLING [31:16] :
                                            // Reserved/Checksum

#define HIB1P2_HIB1P2_EFUSE_READ_REG1_FUSEFARM_ROW_13_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_HIB1P2_POR_TEST_CTRL register.
//
//******************************************************************************
#define HIB1P2_HIB1P2_POR_TEST_CTRL_reserved_M \
                                0xFFFFFF00

#define HIB1P2_HIB1P2_POR_TEST_CTRL_reserved_S 8
#define HIB1P2_HIB1P2_POR_TEST_CTRL_mem_prcm_por_test_ctrl_M \
                                0x000000FF

#define HIB1P2_HIB1P2_POR_TEST_CTRL_mem_prcm_por_test_ctrl_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_HIB_TIMER_SYNC_CALIB_CFG0 register.
//
//******************************************************************************
#define HIB1P2_HIB_TIMER_SYNC_CALIB_CFG0_reserved_M \
                                0xFFFF0000

#define HIB1P2_HIB_TIMER_SYNC_CALIB_CFG0_reserved_S 16
#define HIB1P2_HIB_TIMER_SYNC_CALIB_CFG0_mem_cfg_calib_time_M \
                                0x0000FF00

#define HIB1P2_HIB_TIMER_SYNC_CALIB_CFG0_mem_cfg_calib_time_S 8
#define HIB1P2_HIB_TIMER_SYNC_CALIB_CFG0_NU1_M \
                                0x000000FE

