zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/cc32xx/inc/hw_hib1p2.h
#define HIB1P2_HIB_TIMER_SYNC_CALIB_CFG0_NU1_S 1
#define HIB1P2_HIB_TIMER_SYNC_CALIB_CFG0_mem_cfg_calib_start \
                                0x00000001

//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_HIB_TIMER_SYNC_CALIB_CFG1 register.
//
//******************************************************************************
#define HIB1P2_HIB_TIMER_SYNC_CALIB_CFG1_reserved_M \
                                0xFFF00000

#define HIB1P2_HIB_TIMER_SYNC_CALIB_CFG1_reserved_S 20
#define HIB1P2_HIB_TIMER_SYNC_CALIB_CFG1_fast_calib_count_M \
                                0x000FFFFF

#define HIB1P2_HIB_TIMER_SYNC_CALIB_CFG1_fast_calib_count_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_HIB_TIMER_SYNC_CFG2 register.
//
//******************************************************************************
#define HIB1P2_HIB_TIMER_SYNC_CFG2_reserved_M \
                                0xFFFFFE00

#define HIB1P2_HIB_TIMER_SYNC_CFG2_reserved_S 9
#define HIB1P2_HIB_TIMER_SYNC_CFG2_mem_cfg_hib_unload \
                                0x00000100

#define HIB1P2_HIB_TIMER_SYNC_CFG2_NU1_M \
                                0x000000FC

#define HIB1P2_HIB_TIMER_SYNC_CFG2_NU1_S 2
#define HIB1P2_HIB_TIMER_SYNC_CFG2_mem_cfg_tsf_adj \
                                0x00000002

#define HIB1P2_HIB_TIMER_SYNC_CFG2_mem_cfg_update_tsf \
                                0x00000001

//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_HIB_TIMER_SYNC_TSF_ADJ_VAL register.
//
//******************************************************************************
#define HIB1P2_HIB_TIMER_SYNC_TSF_ADJ_VAL_mem_tsf_adj_val_M \
                                0xFFFFFFFF

#define HIB1P2_HIB_TIMER_SYNC_TSF_ADJ_VAL_mem_tsf_adj_val_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_HIB_TIMER_RTC_GTS_TIMESTAMP_LSW register.
//
//******************************************************************************
#define HIB1P2_HIB_TIMER_RTC_GTS_TIMESTAMP_LSW_rtc_gts_timestamp_lsw_M \
                                0xFFFFFFFF

#define HIB1P2_HIB_TIMER_RTC_GTS_TIMESTAMP_LSW_rtc_gts_timestamp_lsw_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_HIB_TIMER_RTC_GTS_TIMESTAMP_MSW register.
//
//******************************************************************************
#define HIB1P2_HIB_TIMER_RTC_GTS_TIMESTAMP_MSW_reserved_M \
                                0xFFFF0000

#define HIB1P2_HIB_TIMER_RTC_GTS_TIMESTAMP_MSW_reserved_S 16
#define HIB1P2_HIB_TIMER_RTC_GTS_TIMESTAMP_MSW_rtc_gts_timestamp_msw_M \
                                0x0000FFFF

#define HIB1P2_HIB_TIMER_RTC_GTS_TIMESTAMP_MSW_rtc_gts_timestamp_msw_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_HIB_TIMER_RTC_WUP_TIMESTAMP_LSW register.
//
//******************************************************************************
#define HIB1P2_HIB_TIMER_RTC_WUP_TIMESTAMP_LSW_rtc_wup_timestamp_lsw_M \
                                0xFFFFFFFF

#define HIB1P2_HIB_TIMER_RTC_WUP_TIMESTAMP_LSW_rtc_wup_timestamp_lsw_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_HIB_TIMER_RTC_WUP_TIMESTAMP_MSW register.
//
//******************************************************************************
#define HIB1P2_HIB_TIMER_RTC_WUP_TIMESTAMP_MSW_reserved_M \
                                0xFFFF0000

#define HIB1P2_HIB_TIMER_RTC_WUP_TIMESTAMP_MSW_reserved_S 16
#define HIB1P2_HIB_TIMER_RTC_WUP_TIMESTAMP_MSW_rtc_wup_timestamp_msw_M \
                                0x0000FFFF

#define HIB1P2_HIB_TIMER_RTC_WUP_TIMESTAMP_MSW_rtc_wup_timestamp_msw_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_HIB_TIMER_SYNC_WAKE_OFFSET_ERR register.
//
//******************************************************************************
#define HIB1P2_HIB_TIMER_SYNC_WAKE_OFFSET_ERR_reserved_M \
                                0xFFFFF000

#define HIB1P2_HIB_TIMER_SYNC_WAKE_OFFSET_ERR_reserved_S 12
#define HIB1P2_HIB_TIMER_SYNC_WAKE_OFFSET_ERR_wup_offset_error_M \
                                0x00000FFF

#define HIB1P2_HIB_TIMER_SYNC_WAKE_OFFSET_ERR_wup_offset_error_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_HIB_TIMER_SYNC_TSF_CURR_VAL_LSW register.
//
//******************************************************************************
#define HIB1P2_HIB_TIMER_SYNC_TSF_CURR_VAL_LSW_tsf_curr_val_lsw_M \
                                0xFFFFFFFF

#define HIB1P2_HIB_TIMER_SYNC_TSF_CURR_VAL_LSW_tsf_curr_val_lsw_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_HIB_TIMER_SYNC_TSF_CURR_VAL_MSW register.
//
//******************************************************************************
#define HIB1P2_HIB_TIMER_SYNC_TSF_CURR_VAL_MSW_tsf_curr_val_msw_M \
                                0xFFFFFFFF

#define HIB1P2_HIB_TIMER_SYNC_TSF_CURR_VAL_MSW_tsf_curr_val_msw_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the HIB1P2_O_CM_SPARE register.
//
//******************************************************************************
#define HIB1P2_CM_SPARE_CM_SPARE_OUT_M \
                                0xFF000000

#define HIB1P2_CM_SPARE_CM_SPARE_OUT_S 24
#define HIB1P2_CM_SPARE_MEM_CM_TEST_CTRL_M \
                                0x00FF0000

#define HIB1P2_CM_SPARE_MEM_CM_TEST_CTRL_S 16
#define HIB1P2_CM_SPARE_MEM_CM_SPARE_M \
                                0x0000FFFF

#define HIB1P2_CM_SPARE_MEM_CM_SPARE_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_PORPOL_SPARE register.
//
//******************************************************************************
#define HIB1P2_PORPOL_SPARE_MEM_PORPOL_SPARE_M \
                                0xFFFFFFFF

#define HIB1P2_PORPOL_SPARE_MEM_PORPOL_SPARE_S 0
//******************************************************************************
//
// The following are defines for the bit fields in the
// HIB1P2_O_MEM_DIG_DCDC_CLK_CONFIG register.
//
//******************************************************************************
#define HIB1P2_MEM_DIG_DCDC_CLK_CONFIG_MEM_DIG_DCDC_CLK_ENABLE \
                                0x00000100

#define HIB1P2_MEM_DIG_DCDC_CLK_CONFIG_MEM_DIG_DCDC_CLK_PLLGEN_OFF_TIME_M \
                                0x000000F0

#define HIB1P2_MEM_DIG_DCDC_CLK_CONFIG_MEM_DIG_DCDC_CLK_PLLGEN_OFF_TIME_S 4
#define HIB1P2_MEM_DIG_DCDC_CLK_CONFIG_MEM_DIG_DCDC_CLK_PLLGEN_ON_TIME_M \
                                0x0000000F

